//企业发放奖金根据利润提成
//利润低于等于10万元，奖金提成10%，高于10万元部分提成7.5%
//20-40万元，高于20万元部分可提成5%
//40-60万元，高于40万元部分可提成3%
//60-100万元，高于60万元部分可提成1.5%
//高于100万元时，超过100万元的部分按1%提成
//输入月利润，求奖金总数

#include<stdio.h>

int main(int argc, const char* argv[]) {
	int profit = 0;
	int bonus = 0;

	scanf_s("%d", &profit);
	//利润低于等于10万元，奖金提成10%，高于10万元部分提成7.5%
	if (profit <= 100000) {
		bonus = profit * 0.1;
	}
	else if (profit <= 200000) {
		bonus = 100000 * 0.1 + (profit - 100000) * 0.075;
	}
	//20-40万元，高于20万元部分可提成5%
	else if (profit <= 400000) {
		bonus = 100000 * 0.1 + 100000 * 0.075 + (profit - 200000) * 0.05;
	}
	//40-60万元，高于40万元部分可提成3%
	else if (profit <= 600000) {
		bonus = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + (profit - 400000) * 0.03;
	}
	//60-100万元，高于60万元部分可提成1.5%
	else if (profit <= 1000000) {
		bonus = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + (profit - 600000) * 0.015;
	}
	//高于100万元时，超过100万元的部分按1%提成
	else {
		bonus = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + 400000 * 0.015 + (profit - 1000000) * 0.01;
	}

	printf("bonus=%d\n", bonus);
	
	return 0;
}